Revit 2024 API
SimpleWorksetConfiguration Enumeration
 Indicates the set of user-created worksets to open in memory
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public enum SimpleWorksetConfiguration
Visual Basic
Public Enumeration SimpleWorksetConfiguration
Visual C++
public enum class SimpleWorksetConfiguration
Members
Member name | Description
AllWorksets |  All user-created worksets.
AllEditable |  All user-created worksets checked out to the current user.
LastViewed |  The set of user-created worksets last opened for this model.
AskUserToSpecify |  Explicitly ask the user the specify which user-created worksets to open.
See Also
Autodesk.Revit.DB Namespace